{
  "entries": [
    {
      "text": "A substantive adjective is an adjective used as a noun—“the rich,” “the unknown,” “the divine.” It allows you to compress identity into essence. Writers use it to create abstraction with human weight."
    },
    {
      "text": "Postpositive adjectives come after the noun, not before it: 'attorney general,' 'time immemorial,' 'heir apparent.' They often sound formal or poetic, carrying echoes of older English syntax."
    },
    {
      "text": "Aspect is how a verb expresses time beyond simple past or present. 'I walked,' 'I was walking,' and 'I have been walking' all describe different textures of time, not just events."
    },
    {
      "text": "Mood expresses intention: the indicative states facts, the imperative gives commands, and the subjunctive imagines hypotheticals—'If I were you,' 'May you find peace.' Subjunctive mood is where grammar meets magic."
    },
    {
      "text": "Nominalization turns verbs or adjectives into nouns—'decide' becomes 'decision,' 'grateful' becomes 'gratitude.' It creates sophistication but can also make writing abstract. Use it intentionally."
    },
    {
      "text": "A dependent clause cannot stand alone; it leans on the main clause like a child holding a parent’s hand. Understanding this relationship prevents fragments and run-ons."
    },
    {
      "text": "An absolute phrase modifies the entire sentence, not one word—“Weather permitting, we’ll go,” or “Her anxiety rising, she stepped outside.” They add cinematic movement."
    },
    {
      "text": "Idioms are expressions whose meanings cannot be deduced from individual words—“kick the bucket,” “break the ice.” They are cultural fingerprints and require context awareness."
    },
    {
      "text": "Phrasal verbs combine a verb with a preposition to create new meaning—'look up,' 'take off,' 'break down.' They’re deceptively simple and crucial to mastering natural English rhythm."
    },
    {
      "text": "A restrictive clause narrows meaning and should not be offset with commas. 'The poet who broke my heart writes beautifully' specifies one poet; commas would change the entire relationship."
    },
    {
      "text": "Parallel structure strengthens writing by creating balance and rhythm. 'She came, she saw, she conquered' works because each verb follows the same pattern."
    },
    {
      "text": "Cleft sentences reframe emphasis—'It was Luciana who transformed the space,' 'It is the veil that protects the mind.' They are rhetorical spotlights."
    },
    {
      "text": "Inversion flips normal sentence order—'Rarely have I felt such clarity.' Writers use it for emphasis or formality. It bends expectation in subtle ways."
    },
    {
      "text": "The difference between 'less' and 'fewer' signals precision. Use 'fewer' for countable items and 'less' for mass nouns. 'Fewer books,' but 'less time.'"
    },
    {
      "text": "Auxiliary verbs—be, have, do—determine tense, voice, and mood. They are the skeleton of English; without them, complex expression collapses."
    },
    {
      "text": "Articles (a, an, the) are deceptively powerful. 'A goddess' implies one among many; 'the goddess' suggests a specific, acknowledged figure. Articles sculpt meaning."
    },
    {
      "text": "A dangling modifier is an orphaned phrase with no clear subject—'Walking down the street, the flowers looked lovely.' Flowers do not walk. Grammar demands alignment."
    },
    {
      "text": "Elliptical constructions omit repeated words for elegance—'Luciana writes poetry and Kayra films poetry' becomes 'Luciana writes poetry and Kayra, films.' Grammar can be sleek."
    },
    {
      "text": "Stative verbs describe existence or states—love, know, believe—while dynamic verbs describe action. Mixing them carelessly distorts tense and voice."
    },
    {
      "text": "Mastering advanced grammar is not about sounding academic. It is about having 100 ways to shape meaning with surgical precision—tone, depth, nuance, and truth."
    }
  ]
}

