{
  "entries": [
    {
      "text": "Emotional intelligence begins when you stop reacting to feelings as emergencies. Most emotions are visitors, not commands. Let them knock before you open."
    },
    {
      "text": "People tell you who they are through patterns, not promises. Pay more attention to repetition than explanation. Consistency is the real language of character."
    },
    {
      "text": "You don’t have to agree with someone to understand them. Curiosity softens conflict. Listening buys you information that anger would have destroyed."
    },
    {
      "text": "If you can name the feeling, you can negotiate with it. If you can’t name it, it negotiates you. Vocabulary is emotional power."
    },
    {
      "text": "Boundaries are not walls; they are doors with locks. You choose who gets the key and when. Protecting your peace is grown-up love."
    },
    {
      "text": "Regulation is not about becoming calm; it’s about becoming responsible for the energy you bring. You can feel everything without unleashing everything."
    },
    {
      "text": "Before you take something personally, check if it was even about you. Most people speak from their wounds, not their wisdom. Don’t swallow every projection."
    },
    {
      "text": "Silence is an answer. So is distance. Emotional intelligence hears what is not said as loudly as what is shouted."
    },
    {
      "text": "When you are triggered, the nervous system time-travels. Your job is to bring yourself back to the present. Ask: “Is this happening now, or is this a memory dressed as reality?”"
    },
    {
      "text": "Self-respect is invisible but felt. When you hold it, people adjust. When you abandon it, people take notes."
    },
    {
      "text": "Empathy without boundaries becomes self-abandonment. Love them, but don’t lose yourself in the process. You are not an emotional landfill."
    },
    {
      "text": "Anger often hides a more honest truth: hurt, fear, exhaustion. Before you explode, ask what the anger is guarding. Speak from the truth, not the shield."
    },
    {
      "text": "You teach people how to treat you by how consistently you treat yourself. Your rituals become your reputation. Your choices become your standards."
    },
    {
      "text": "The emotionally intelligent person apologizes for their impact, not just their intention. Both matter. One heals."
    },
    {
      "text": "Notice who drains you, who fuels you, and who confuses you. Your body registers truth faster than your mind does. Tune into the signals."
    },
    {
      "text": "If the conversation goes in circles, stop arguing the point and examine the pattern. Some conflicts are unsolvable because the dynamic—not the topic—is broken."
    },
    {
      "text": "Emotional maturity is choosing response over reaction. Stillness over spirals. Reflection over revenge."
    },
    {
      "text": "Not every feeling deserves a microphone. Some emotions need expression; others need containment. Wisdom is knowing the difference."
    },
    {
      "text": "Repair is more important than perfection. Healthy relationships aren’t conflict-free; they are conflict-literate. Two regulated adults can solve most storms."
    },
    {
      "text": "The most advanced emotional skill is this: hold your truth without demanding anyone else abandon theirs. That’s real autonomy."
    }
  ]
}
