{
  "entries": [
    {
      "text": "Grammar is not about policing; it is about clarity. The goal is not perfection but being understood with minimal friction."
    },
    {
      "text": "A sentence needs a subject and a verb. If you can’t find who is doing the action and what they are doing, you’re probably looking at a fragment."
    },
    {
      "text": "“Its” with no apostrophe shows possession. “It’s” with an apostrophe always means “it is” or “it has.” If you can’t swap it with “it is,” remove the apostrophe."
    },
    {
      "text": "Commas often mirror natural pauses, but not every pause deserves a comma. Use them for clarity, not decoration."
    },
    {
      "text": "Active voice usually makes your writing cleaner and more powerful: “I broke the vase” is clearer than “The vase was broken by me.”"
    },
    {
      "text": "Subject–verb agreement is crucial. Strip the sentence down to the core noun when unsure: “The bouquet of roses is lovely”—the subject is bouquet, not roses."
    },
    {
      "text": "Avoid comma splices: two sentences cannot be welded together with a comma alone. Use a period, semi-colon, or conjunction to join them correctly."
    },
    {
      "text": "Adverbs often weaken writing when overused. If a sentence relies on 'really,' 'very,' or 'just,' rewrite it with stronger verbs and nouns instead."
    },
    {
      "text": "Prepositions are relationship words: they show position, direction, or time. If a sentence feels clumsy, check if your prepositions are doing their job cleanly."
    },
    {
      "text": "Avoid double negatives unless intentional for voice or dialect. In standard English, 'I don’t know anything' is cleaner than 'I don’t know nothing.'"
    },
    {
      "text": "A misplaced modifier attaches meaning to the wrong part of the sentence. 'Walking to the store, the rain soaked me' suggests the rain was walking. Place modifiers near what they describe."
    },
    {
      "text": "Parallel structure makes writing flow. If you start a list with verbs, keep them all verbs; if you start with nouns, keep them all nouns. Consistency creates rhythm."
    },
    {
      "text": "Not all run-on sentences are long; some are simply improperly joined. A run-on is two complete thoughts pretending to be one. Give each its own space or connect them properly."
    },
    {
      "text": "Apostrophes show ownership or contraction, not pluralization. 'Three cat’s' is never correct unless those cats own something."
    },
    {
      "text": "Colons introduce something: an explanation, a list, or a dramatic reveal. Think of them as a drumroll—what follows should complete or illuminate what came before."
    },
    {
      "text": "Quotation marks go around direct speech or text someone actually said. Thoughts, feelings, and indirect speech do not need them unless stylistically chosen."
    },
    {
      "text": "Hyphens connect closely linked words, like 'long-term' or 'high-quality.' When in doubt, ask if the two words create one meaning before the noun."
    },
    {
      "text": "Ellipses (…) imply hesitation, omission, or trailing thought—not emotional collapse. Use them sparingly, or they dilute your message."
    },
    {
      "text": "Semi-colons connect two complete, related sentences when a period feels too final. They are punctuation’s elegant bridge."
    },
    {
      "text": "Your grammar does not define your intelligence or your worth. It is a tool—not a test. Use it to convey your truth, not to shrink your voice."
    }
  ]
}
